Core/src/InformationRegisters/ПриходыУходыСотрудников/ПриходыУходыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриходыУходыСотрудников</name>
  <resources>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>DeviceId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/InformationRegisters/ПриходыУходыСотрудников/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ОткрытьНастройкиОбмена(Команда)
	
	ОткрытьФорму("РегистрСведений.ПриходыУходыСотрудников.Форма.ФормаНастройкиСоединения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуДанныхИзФайла(Команда)
	
	ТекстВопроса = НСтр("ka='Выполнить загрузку данных?';ru='Выполнить загрузку данных?';en='Выполнить загрузку данных?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗагрузкуДанныхИзФайлаЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуДанныхИзФайлаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		ВыполнитьЗагрузкуДанныхНаСервере();
		Элементы.Список.Обновить();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьЗагрузкуДанныхНаСервере()

	Перем ПутьКФайлу;
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиОбменаХЗ = Константы.НастройкиОбменаСДаннымиОПосещенииСотрудников.Получить();
	Если НастройкиОбменаХЗ <> Неопределено Тогда
	
		НастройкиОбмена = НастройкиОбменаХЗ.Получить();
		Если ТипЗнч(НастройкиОбмена) = Тип("Структура")
			И НастройкиОбмена.Свойство("ПутьКФайлу", ПутьКФайлу)
			Тогда
		
			Файл = Новый Файл(ПутьКФайлу);
			Если Не Файл.Существует() Тогда
			  
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ka='Файл ';ru='Файл ';en='Файл '") + ПутьКФайлу + НСтр("ka=' не найден';ru=' не найден';en=' не найден'");
				Сообщение.Сообщить(); 
				Возврат;
			
			КонецЕсли;
			
			ТабДок = Новый ТабличныйДокумент;
			ТабДок.Прочитать(ПутьКФайлу);
			НаборЗаписей = РегистрыСведений.ПриходыУходыСотрудников.СоздатьНаборЗаписей();
			Период = ТекущаяДатаСеанса();
			ТаблицаЗагрузки = НаборЗаписей.ВыгрузитьКолонки();
			
			Для Сч = 2 По ТабДок.ВысотаТаблицы Цикл
			
				СтрокаТаблицы = ТаблицаЗагрузки.Добавить();
				СтрокаТаблицы.Дата = СокрЛП(ТабДок.Область(Сч, 5, Сч, 5).Текст);
				СтрокаТаблицы.DeviceId = СокрЛП(ТабДок.Область(Сч, 1, Сч, 1).Текст);
				СтрокаТаблицы.PersonId = СокрЛП(ТабДок.Область(Сч, 2, Сч, 2).Текст);
			
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки);
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаЗагрузки.Дата КАК Дата,
			|	ТаблицаЗагрузки.DeviceId КАК DeviceId,
			|	ТаблицаЗагрузки.PersonId КАК PersonId
			|ПОМЕСТИТЬ ВТ_ТаблицаЗагрузки
			|ИЗ
			|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	PersonId
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПриходыУходыСотрудников.Дата КАК Дата,
			|	ПриходыУходыСотрудников.Сотрудник.PersonId КАК PersonId
			|ПОМЕСТИТЬ ВТ_ЗаписиРегистра
			|ИЗ
			|	РегистрСведений.ПриходыУходыСотрудников КАК ПриходыУходыСотрудников
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	PersonId,
			|	Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	&Период КАК ДатаЗагрузки,
			|	Сотрудники.Ссылка КАК Сотрудник,
			|	ВТ_ТаблицаЗагрузки.Дата КАК Дата,
			|	ВТ_ТаблицаЗагрузки.DeviceId КАК DeviceId,
			|	ВТ_ТаблицаЗагрузки.PersonId КАК PersonId
			|ИЗ
			|	ВТ_ТаблицаЗагрузки КАК ВТ_ТаблицаЗагрузки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ВТ_ТаблицаЗагрузки.PersonId = Сотрудники.PersonId
			|ГДЕ
			|	ВТ_ТаблицаЗагрузки.PersonId > 0
			|	И НЕ (ВТ_ТаблицаЗагрузки.PersonId, ВТ_ТаблицаЗагрузки.Дата) В
			|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|					ВТ_ЗаписиРегистра.PersonId КАК PersonId,
			|					ВТ_ЗаписиРегистра.Дата КАК Дата
			|				ИЗ
			|					ВТ_ЗаписиРегистра КАК ВТ_ЗаписиРегистра)";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
			
				МенеджерЗаписи = РегистрыСведений.ПриходыУходыСотрудников.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка); 
				МенеджерЗаписи.Записать();
			
			КонецЦикла; 
			
		КонецЕсли; 
	
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	

КонецПроцедуры // ВыполнитьЗагрузкуДанныхНаСервере()

&НаКлиенте
Процедура ОчиститьЗаписи(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗаписиЗавершение", ЭтотОбъект), "Очистить все записи регитра?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗаписиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		ОчиститьЗаписиНаСервере();	
		Элементы.Список.Обновить();
	
	КонецЕсли; 	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьЗаписиНаСервере()
	
	НаборЗаписей = РегистрыСведений.ПриходыУходыСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры
